Revit 2025 API
ConceptualConstructionOpeningType Enumeration
 ConceptualConstructionType values for Openings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ConceptualConstructionOpeningType
Public Enumeration ConceptualConstructionOpeningType
public enum class ConceptualConstructionOpeningType
type ConceptualConstructionOpeningType
Members
Member name | Value | Description
Air | 0 |  Air Opening
NumOpeningTypeConstruction | 1 |  Total Number of Opening Type Constructions
InvalidOpeningTypeConstruction | -1 |  Invalid value/not set Opening Type Construction
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace